class Answers:
    ANSWER_Q_1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    ANSWER_Q_2 = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
    ANSWER_Q_3 = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    ANSWER_Q_4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    ANSWER_Q_5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    ANSWER_Q_6 = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    ANSWER_Q_7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    ANSWER_Q_8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

class RedirectUrl_From_MainPage:
    Dzen_Url = 'dzen.ru'
    Scooter_Url = 'qa-scooter'
    Order_Url = 'https://qa-scooter.praktikum-services.ru/order'

class Test_User1:
    TEST_NAME = "Михаил"
    TEST_SURNAME = "Волынков"
    TEST_ADDRESS = "Невский проспект"
    TEST_UNDERGROUND = "Парк культуры"
    TEST_NUMBER = "+89313511199"
    TEST_COMMENT = "Тестовый комментарий User1"

class Test_User2:
    TEST_NAME = "Алиса"
    TEST_SURNAME = "Селезнёва"
    TEST_ADDRESS = "Земляная 17"
    TEST_UNDERGROUND = "Парк культуры"
    TEST_NUMBER = "+79999999999"
    TEST_COMMENT = "Тестовый комментарий User2"